define([], function () {// 清分清算公共状态

    //操作页面状态
    var SETTLE_MAP = {
        1 : {
            page: '清算控制表',
            map: {
                "0" : "批次确认完成",
                "1" : "批次对帐完成",
                "2" : "批次对帐中",
                "3" : "批次入账完成",
                "4" : "批次入账处理失败",
                "5" : "批次入账处理中",
                "6" : "选择付款通道及入账方式",
                "7" : "领取任务",
                "8" : "划分批次中",
                "9" : "初始化状态"
            }
        },
        2 : {
            page: '清算流水表',
            map: {
                "0": "入账成功",
                "1": "入账失败",
                "2": "超时",
                "3": "入账受理成功",
                "4": "提交请求",
                "5": "已拆分批次",
                "6": "初始化信息",
                "7": "暂停清算"
            }
        },
        3 : {
            page: '入账差错信息表',
            map: {
                "0" : "参入清算后并已清算",
                //"1" : "处理后参入下一批清算",
                "2" : "处理后手工清算",
                "3": "待清算人员处理",
                "4" : "待自动清算",
                "5" : "自动清算中",
                "6" : "自动清算成功",
                "9" : "未处理",
                "91" : '入账失败',
                "92" : '未知'
            }
        },
        4 : {
            page: '清算批次锁表',
            map: {
                '0' : '已被领取加锁',
                '1' : '已被解锁'
            }
        }
    }

    return SETTLE_MAP;

});

